; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v6 ?v3)
             (pred_5 ?v12 ?v5)
             (pred_11 ?v6 ?v5)
             (pred_4 ?v4 ?v6 )
	     (pred_8 ?v6)
             (pred_10 ?v1)
             (pred_12 ?v12)
             (pred_6 ?v5)
             (pred_7 ?v6)
             (pred_9 ?v12)
             (pred_3 ?v6)
             (pred_2 ))



(:action op_1
:parameters (?v11 ?v2 ?v10 ?v8)
:precondition (and (pred_10 ?v11) (pred_10 ?v2) (pred_12 ?v10) (pred_6 ?v8)
          (pred_1 ?v11 ?v2) (pred_5 ?v10 ?v8)
                   (pred_11 ?v2 ?v8) (pred_8 ?v11) 
                   (pred_7 ?v2) (pred_9 ?v10))
:effect (and  (pred_3 ?v2) (not (pred_7 ?v2))))


(:action op_2
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_10 ?v9)
               (pred_8 ?v11) (pred_1 ?v11 ?v9) (pred_3 ?v9))
:effect (and (pred_8 ?v9) (not (pred_8 ?v11))))

(:action op_5
:parameters (?v11 ?v10)
:precondition (and (pred_10 ?v11) (pred_12 ?v10) 
                  (pred_8 ?v11) (pred_4 ?v10 ?v11) (pred_2 ))
:effect (and (pred_9 ?v10)
   (not (pred_4 ?v10 ?v11)) (not (pred_2 ))))


(:action op_3
:parameters (?v11 ?v13 ?v7)
:precondition (and (pred_10 ?v11) (pred_12 ?v13) (pred_12 ?v7)
                  (pred_8 ?v11) (pred_9 ?v7) (pred_4 ?v13 ?v11))
:effect (and (pred_9 ?v13) (pred_4 ?v7 ?v11)
        (not (pred_9 ?v7)) (not (pred_4 ?v13 ?v11))))

(:action op_4
:parameters (?v11 ?v10)
:precondition (and (pred_10 ?v11) (pred_12 ?v10) 
                  (pred_8 ?v11) (pred_9 ?v10))
:effect (and (pred_2 ) (pred_4 ?v10 ?v11) (not (pred_9 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_02 obj_16 obj_17 obj_10 obj_28 obj_07 obj_32 obj_26 obj_13 obj_29 obj_15 obj_05 obj_01 obj_03 obj_06 obj_27 obj_19 obj_14 obj_23 obj_09 obj_20 obj_30 obj_04 obj_31 obj_12
    obj_18 obj_08 obj_21
    obj_11 obj_22 obj_24 obj_25
    )

    (:init
       (pred_2)

       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_28)
       (pred_10 obj_07)
       (pred_10 obj_32)
       (pred_10 obj_26)
       (pred_10 obj_13)
       (pred_10 obj_29)
       (pred_10 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_27)
       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_23)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_30)
       (pred_10 obj_04)
       (pred_10 obj_31)
       (pred_10 obj_12)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_12 obj_11)
       (pred_12 obj_22)
       (pred_12 obj_24)
       (pred_12 obj_25)

       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_16)
       (pred_1 obj_16 obj_32)
       (pred_1 obj_16 obj_17)
       (pred_1 obj_16 obj_02)
       (pred_1 obj_17 obj_26)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_16)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_10 obj_28)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_28 obj_29)
       (pred_1 obj_28 obj_10)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_32)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_32 obj_05)
       (pred_1 obj_32 obj_26)
       (pred_1 obj_32 obj_16)
       (pred_1 obj_32 obj_07)
       (pred_1 obj_26 obj_01)
       (pred_1 obj_26 obj_13)
       (pred_1 obj_26 obj_17)
       (pred_1 obj_26 obj_32)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_29)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_26)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_29 obj_28)
       (pred_1 obj_29 obj_13)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_05 obj_32)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_26)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_03 obj_23)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_06 obj_29)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_27 obj_20)
       (pred_1 obj_27 obj_19)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_19 obj_30)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_27)
       (pred_1 obj_14 obj_04)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_23 obj_31)
       (pred_1 obj_23 obj_09)
       (pred_1 obj_23 obj_03)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_23)
       (pred_1 obj_20 obj_30)
       (pred_1 obj_20 obj_27)
       (pred_1 obj_30 obj_04)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_30 obj_20)
       (pred_1 obj_04 obj_31)
       (pred_1 obj_04 obj_14)
       (pred_1 obj_04 obj_30)
       (pred_1 obj_31 obj_12)
       (pred_1 obj_31 obj_23)
       (pred_1 obj_31 obj_04)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_31)
       (pred_7 obj_16)
       (pred_7 obj_23)
       (pred_7 obj_03)
       (pred_7 obj_31)
       (pred_11  obj_16 obj_18)
       (pred_11  obj_23 obj_08)
       (pred_11  obj_03 obj_21)
       (pred_11  obj_31 obj_21)
       (pred_3 obj_02)
       (pred_3 obj_17)
       (pred_3 obj_10)
       (pred_3 obj_28)
       (pred_3 obj_07)
       (pred_3 obj_32)
       (pred_3 obj_26)
       (pred_3 obj_13)
       (pred_3 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_27)
       (pred_3 obj_19)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_20)
       (pred_3 obj_30)
       (pred_3 obj_04)
       (pred_3 obj_12)

       (pred_5  obj_11 obj_18)
       (pred_5  obj_22 obj_08)
       (pred_5  obj_24 obj_21)
       (pred_5  obj_25 obj_08)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_22 obj_32)
       (pred_4 obj_24 obj_09)
       (pred_4 obj_25 obj_13)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_4 obj_11 obj_27)
       (pred_4 obj_25 obj_26)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_2 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 0 of 2
2. (op_2 obj_07 obj_32)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_32)
   goals met: 0 of 2
3. (op_2 obj_32 obj_26)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_26)
   goals met: 0 of 2
4. (op_2 obj_26 obj_13)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_13)
   goals met: 0 of 2
5. (op_5 obj_13 obj_25)
   deleted: (pred_4 obj_25 obj_13) (pred_2)
   added: (pred_9 obj_25)
   goals met: 0 of 2
6. (op_2 obj_13 obj_26)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_26)
   goals met: 0 of 2
7. (op_4 obj_26 obj_25)
   deleted: (pred_9 obj_25)
   added: (pred_2) (pred_4 obj_25 obj_26)
   goals met: 1 of 2
8. (op_2 obj_26 obj_32)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_32)
   goals met: 1 of 2
9. (op_5 obj_32 obj_22)
   deleted: (pred_4 obj_22 obj_32) (pred_2)
   added: (pred_9 obj_22)
   goals met: 1 of 2
10. (op_2 obj_32 obj_05)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_05)
   goals met: 1 of 2
11. (op_2 obj_05 obj_19)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_19)
   goals met: 1 of 2
12. (op_2 obj_19 obj_27)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_27)
   goals met: 1 of 2
13. (op_2 obj_27 obj_20)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_20)
   goals met: 1 of 2
14. (op_3 obj_20 obj_11 obj_22)
   deleted: (pred_9 obj_22) (pred_4 obj_11 obj_20)
   added: (pred_9 obj_11) (pred_4 obj_22 obj_20)
   goals met: 1 of 2
15. (op_2 obj_20 obj_27)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_27)
   goals met: 1 of 2
16. (op_4 obj_27 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_2) (pred_4 obj_11 obj_27)
   goals met: 2 of 2
